app/controllers/sounds_controller.rb

SELECT * FROM "sounds"
---
  def index
    respond_to do |format|
      format.html {redirect_to @soundwalk}
      if params[:show] == 'sounds'
        format.json {render :json => @soundwalk.sounds.to_json(sound_options), :callback => params[:callback], :status => :ok}
        format.xml {render :xml => @soundwalk.sounds.to_xml(sound_options), :status => :ok}
      else
        format.json {render :json => @soundwalk.sounds.collect {|sound| sound.id}, :callback => params[:callback], :status => :ok}

INSERT INTO "sounds" ("frame_size", "hop_size", "latitude", "updated_at", "frame_length", "recorded_at", "sample_rate", "description", "filename", "features", "spectrum_size", "longitude", "samples", "frames", "hop_length", "created_at") VALUES(1764, 882, -112.56, '2009-06-25 04:50:40', 0.04, '2009-06-25 04:06:50', 44100, 'This is a sound of one hand clapping.', '090402_01.wav', NULL, 1025, 72.34, 481124, 544, 0.02, '2009-06-25 04:50:40')
---
  def create
    if @current_user.can_upload
      if params[:recorded_at]
        params[:sound]['recorded_at'] = Time.parse(params[:recorded_at])
      end

      params[:sound]['user_id'] = current_user.id

      @sound = @soundwalk.sounds.build(params[:sound])

      respond_to do |format|
        if @sound.save

DELETE FROM "sounds" WHERE "id" = 9
---
  def destroy
    @sound.destroy